/* 
  Localizable.strings
  Bartender 4

  Created by Ben Surtees on 03/02/2022.
  Copyright © 2022 Surtees Studios. All rights reserved.
*/

/*NOTES FOR USING LOCALISED STRINGS
  To Use localised string you use NSLocalizedString("ITEM NAME", comment: "DESCRIPTION OF USE")
 To Use localised string with text inserts String(format: NSLocalizedString("ITEM NAME", comment: "DESCRIPTION OF USE"), TEXT TO INSERT)
 
 */


/* Preferenaces Side Bar*/

"General" = "通用";
"Menu Bar Layout" = "菜单栏布局";
"Show on Trigger" = "触发时显示";
"Menu Bar Style" = "菜单栏样式";
"Widgets" = "小部件";
"Hot Keys" = "快捷键";
"Presets" = "预设操作";
"Triggers" = "触发器";
"Advanced" = "高级设置";
"License" = "许可证";
"About" = "关于我们";


/* STandard Buttons */

"OK" = "确定";
"Cancel" = "取消";
"Dont Show Again" = "不再显示";
"Open Settings" = "打开设置";
"Retry" = "重试";
"Learn More" = "了解更多";
"Done" = "完成";
"Select" = "选择";

/*-----------------------------------------------------------*/


/* Messages when a app is unresposive, shown in a popup alert*/

"AppUnresposive Title" = "%@ 反应迟钝"; // @ is a app name (could be localised
"AppUnresposive Message" = "%@ 可能需要重新启动.\n虽然它是不负责任的,但Bartender不能显示或隐藏它, 或其他菜单栏项.\n您可以使用活动监视器退出它."; // @ is a app name (could be localised
"Open Activity Monitor" = "打开活动监视器";
"Force Quit APP" = "强制退出 %@"; // @ is a app name (could be localised

/*-----------------------------------------------------------*/


/* 无法移动项目警告 */

"Item Not Movable MessageText" = "项目无法移动";
"Item Not Movable InformativeText" = "macOS 阻止用户移动时钟、控制中心和 Siri。";

/*-----------------------------------------------------------*/

/* 使用 SF 符号警告 */

"Apple tech Symbol Title" = "苹果%@符号"; // @ = 苹果技术名称，如 airpods、mac、iPhone 等。
"Apple tech Symbol Text" = "苹果表示这个符号只应用于提及苹果%@。";  // @ = 苹果技术名称，如 airpods、mac、iPhone 等。
"Use Symbol" = "使用符号"; // 按钮

/*-----------------------------------------------------------*/
/* 辅助功能点击示例警告 */

"Accessibitlity Click on Example Alert Title" = "您点击了一个示例";
"Accessibitlity Click on Example Alert Text" = "请在 macOS 系统设置中打开看起来像这样的开关。";

/*-----------------------------------------------------------*/

/* 时钟警告 */

"Bartender Recommends Changing Clock Setting" = "Bartender 推荐更改隐藏日期的新 macOS 时钟设置";
"Clock Setting Title Text" = "macOS 12.4 引入了一个新设置，默认情况下仅在没有隐藏的菜单栏项目时显示日期。\n这意味着当 Bartender 运行时日期不可见，除非您将其设置为“始终”在：\n系统偏好设置 > 码头与菜单栏 > 时钟 > 显示日期：设置为“始终”";
"Open Clock Preferences" = "打开时钟偏好设置";
"Open Clock Settings" = "打开系统设置 > 桌面与码头";

"Clock Setting Title Text Ventura" = "macOS 12.4 引入了一个新设置，默认情况下仅在没有隐藏的菜单栏项目时显示日期。\n这意味着当 Bartender 运行时日期不可见，除非您将其设置为“始终”在：\n系统设置 > 控制中心 > 时钟 > 时钟选项按钮 > 显示日期：设置为“始终”";
"Open Clock Preferences Ventura" = "打开时钟选项";
"Open Clock Settings Ventura" = "打开系统设置 > 控制中心";

/*-----------------------------------------------------------*/
/* 复制许可证警告消息 */

"Copying license Alert  Title" = "许可证信息";
"Copying license Alert  Text" = "您的许可证信息中包含个人信息。\n\n请注意不要分享。";

"Copy License Button" = "复制到剪贴板";

"License Info" = "许可证名称：%@\n许可证密钥：%@";

/*-----------------------------------------------------------*/

/* 辅助功能不工作警告消息 */

"Accessibilty Not Working Alert Title" = "Bartender 无法移动项目";
"Accessibilty Not Working Alert Text" = "Bartender 无法使用辅助功能来移动菜单栏项目。请确保在系统设置中启用了这些功能，并尝试关闭再开启。";

"Open System Settings Button" = "打开系统设置";

/*-----------------------------------------------------------*/

/* 鼠标按下不工作警告消息 */

"Mouse Down Not Working Alert Title" = "Bartender 无法移动项目";
"Mouse Down Not Working Alert Text" = "Bartender 无法移动菜单栏项目。这通常是由 macOS 的一个错误导致的，这意味着应用无法使用辅助功能，在使用 ⌘⌥- 缩小屏幕后，或在缩放时。可以通过关闭 macOS 系统设置 > 辅助功能 > 缩放中的所有选项来解决此问题。然后您应该重启 Bartender";


/*-----------------------------------------------------------*/
/* 缩放使用中警告消息 */

"Zoom in use Alert Title" = "当 macOS 缩放功能使用中时，Bartender 无法移动项目";
"Zoom in use Alert Text" = "由于 macOS Sonoma 中 macOS 缩放功能的变更，Bartender 在缩放使用中时无法移动菜单栏项目。\n这可以通过关闭 macOS 系统设置 > 辅助功能 > 缩放中的所有选项来解决。";

/*-----------------------------------------------------------*/

/* 缩放问题警告消息 */

"Zoom Issue Alert Title" = "由于 macOS 缩放错误，Bartender 无法移动项目";
"Zoom Issue Alert Text" = "由于 macOS 缩放功能的错误，应用在使用 macOS 键盘快捷键 ⌘⌥- 缩小后无法使用辅助功能。\n这可以通过关闭 macOS 系统设置 > 辅助功能 > 缩放中的所有选项来解决。\n然后您应该重启 Bartender 以使其再次工作。";

/*-----------------------------------------------------------*/

/* 项目无法移动警告 */

"Item Not Movable Alert Title" = "项目无法移动";
"Item Not Movable Alert Text" = "macOS 阻止用户移动时钟、控制中心和 Siri。";

/*-----------------------------------------------------------*/

/* 应用程序无响应警告 */

"App Unresposive Alert Title" = "%@ 无响应，因此无法显示";
"App Unresposive Alert Text" = "%@ 无响应，可能需要重启。\n在它无响应时，Bartender 无法显示或隐藏它，并且可能无法移动其他项目。";

/*-----------------------------------------------------------*/

/* 菜单项无法移动警告 */

"Menu Item cant be moved Title" = "菜单栏项目无法移动";
"This" = "此";
"Menu Item cant be moved Text" = "%@ 菜单栏项目无法由 Bartender 移动，这通常是由于菜单栏项目应用禁用了 ⌘+拖动功能。";

/*-----------------------------------------------------------*/

/* 添加间隔符警告 */

"Spacer pill title" = "添加间隔符";
"Adding a spacer Title" = "正在添加间隔符";
"Adding a spacer Text" = "将此项目拖动到三个区域之一，在该位置的菜单栏中添加间隔符。\n然后您可以在布局屏幕或菜单栏上点击间隔符，设置其宽度和标签。";

/*-----------------------------------------------------------*/

/* 添加菜单栏项目组警告 */

"Menu Bar Item Group pill title" = "添加菜单栏项目组";
"Adding a Menu Bar Item Group Title" = "正在添加菜单栏项目组";
"Adding a Menu Bar Item Group Text" = "将此项目拖动到一个区域，添加一个自定义菜单栏项目，激活时将显示您添加到该组的菜单栏项目。\n放置后，您可以点击菜单栏项目组进行设置。";

/*-----------------------------------------------------------*/

/* 不正确的许可证版本警告 */

"Incorrect License Version Title" = "输入了旧版本的许可证";
"Incorrect License Version Text" = "看起来您输入了一个较旧的 Bartender 许可证。Bartender 5 是从以前的 Bartender 版本升级的付费升级。\n您可以在试用模式下免费使用 Bartender 5 及其所有出色功能长达 4 周，因为您拥有之前的许可证，您可以购买带有折扣的 Bartender 5 许可证。";

"Discount Button" = "折扣购买";
*-----------------------------------------------------------*/
/* 不正确的许可证警告 */

"Incorrect License Title" = "输入了错误的许可证名称或密钥";
"Incorrect License Text" = "您输入的名称和密钥不是有效的许可证，请检查您是否正确输入，或使用提供给您的自动许可证链接。";

"Discount Button" = "折扣购买";

/*-----------------------------------------------------------*/

/* 超级支持者 */

"Mega Supporter Message" = "感谢您成为 Bartender 的超级支持者！";

/*-----------------------------------------------------------*/

/* Bartender 试用结束菜单栏间距警告 */

"Bartender Trial Finished Menu Bar Spacing Alert Title" = "Bartender 试用结束";
"Bartender Trial Finished Menu Bar Spacing Alert Text" = "一旦您的 Bartender 试用结束，无法更改菜单栏项目的默认间距。\n请购买许可证以设置菜单栏项目间距。";

/*-----------------------------------------------------------*/

/* 菜单栏间距重启警告 */

"Menu Bar Spacing Restart Alert Title" = "需要 macOS 注销";
"Menu Bar Spacing Restart Alert Text" = "要使此设置生效，Bartender 必须设置为登录时启动，您需要注销并重新登录 macOS。";

/*-----------------------------------------------------------*/

/* 无法搜索菜单栏项目警告 */

"Cant search menu bar items Alert Title" = "无法搜索菜单栏项目";
"Cant search menu bar items Alert Text" = "当在次级显示器的全屏应用中时，如果未启用空间功能，菜单栏项目将无法访问";

/*-----------------------------------------------------------*/

/* 码头项目解释警告 */

"Dock Item Explanation Alert Title" = "Bartender 码头项目";
"Dock Item Explanation Alert Text" = "您看到 Bartender 码头图标是因为 Bartender 正在移除左侧菜单以腾出更多空间给菜单项目。macOS 的一个限制是要控制左侧菜单必须有一个码头图标。当您聚焦于其他应用时，码头图标将再次消失。";

/*-----------------------------------------------------------*/

/* 菜单栏颜色渐变选择器 */

"Delete Color Stop" = "删除颜色停靠";
"Change Color" = "更改颜色";
"Add Color Stop" = "为渐变添加颜色停靠";
"Remove color from menu bar" = "从菜单栏移除颜色";
"Color the menu bar" = "给菜单栏上色";

/*-----------------------------------------------------------*/

/* 菜单栏右键菜单项 */

"Change menu bar style" = "更改菜单栏样式...";
"Open Bartender settings..." = "打开 Bartender 设置...";

/*-----------------------------------------------------------*/

/* 菜单栏颜色错误信息 */

"WallpaperIssueTitle" = "Bartender 无法在当前桌面壁纸下调整菜单栏外观";
"DirectoryImagesWarningText" = "桌面壁纸当前设置为自动轮换一个文件夹中的图片。\nBartender 无法在壁纸这样设置时设定菜单栏样式。\n桌面壁纸必须是动态壁纸或静态图片，以便 Bartender 设置菜单栏外观。";
"MissingImagesWarningText" = "当前桌面壁纸图片文件丢失。\n当桌面壁纸图片文件丢失时，Bartender 无法设置菜单栏样式。\n尝试在系统设置中重新设置桌面壁纸，然后再试一次。";

/*-----------------------------------------------------------*/

/* Bartender 排列菜单栏项目通知 */

"Arranging Menu Bar Items Notification Title" = "Bartender 正在排列您的菜单栏项目";
"Arranging Menu Bar Items Notification Text" = "这只会花费一秒钟。";
"Do not show this notification again Text" = "不再显示此通知";
"This notification can be disabled/enabled in Bartenders Advanced Settings" = "此通知可以在 Bartender 高级设置中禁用/启用";

/*-----------------------------------------------------------*/

/* 预设菜单 */

"Presets Menu Title" = "预设";

"Presets Menu Remove Title" = "移除应用的预设";

/*-----------------------------------------------------------*/
/* 触发器 */

"New Trigger Name" = "新触发器名称";

"No Preset Selected to activate" = "未选择预设来激活";

"No Menu Bar items set to show" = "未设置要显示的菜单栏项目";

"No known menu bar items set to show" = "未知的菜单栏项目设置要显示";

"SFU Converted Trigger Title" = "已转换的显示更新脚本触发器 %@";

"SFU Converted Trigger For AppName" = "已转换的显示更新脚本触发器，显示 %@";

"SFU Converted Trigger Description" = "将Bartender 4脚本显示更新转换为触发器，请在启用之前检查它是否符合您的要求，因为可能有更好的方法来使用新的触发条件和预设。";

"Show Wi-Fi when not connected" = "未连接时显示Wi-Fi";

"Show Battery when battery condition met" = "电池条件满足时显示电池";

"Show Time Machine when time machine is backing up." = "当时间机器正在备份时显示时间机器。";

"Location Permission Needed Title" = "需要位置权限";

"Location Permission Needed Description" = "Bartender需要访问您的位置权限以启用位置触发条件";

"Location Permission Needed Wi-Fi Description" = "为了获取Wi-Fi网络名称，需要位置权限";

"Select the menu bar items you want show when triggered" = "选择触发时要显示的菜单栏项目";

"Select the menu bar items you want compare the image of" = "选择要比较图像的菜单栏项目";

"Menu bar items set for comparison not available" = "未提供要比较的菜单栏项目";

"Select a menu bar" = "选择一个菜单栏";

/*-----------------------------------------------------------*/


/* 预设 */

"Default macOS menu bar items" = "默认的macOS菜单栏项目";

"Default macOS Preset description" = "仅显示干净安装macOS的默认菜单栏项目，所有其他菜单栏项目都被隐藏。非常适合录屏或截图。";

"New preset Description" = "";

/*-----------------------------------------------------------*/

/* SubBars */

"Empty SubBar title" = "单击设置组别";

/*-----------------------------------------------------------*/
